var alltowns= [
    
    { city: 'اريحا' , town : 'مدينة اريحا' },
    { city: 'اريحا' , town : 'الجفتلك' },
    { city: 'اريحا' , town : 'الديوك' },
    { city: 'اريحا' , town : 'العوجة' },
    { city: 'اريحا' , town : 'النويعمة' },
    { city: 'اريحا' , town : 'عقبة جبر' },
    { city: 'اريحا' , town : 'عين السلطان' },
    
    { city: 'الخليل' , town : 'مدينة الخليل' },
    { city: 'الخليل' , town : 'اذنا' },
    { city: 'الخليل' , town : 'الشيوخ' },
    { city: 'الخليل' , town : 'الظاهرية' },
    { city: 'الخليل' , town : 'العروب' },
    { city: 'الخليل' , town : 'الفوار' },
    { city: 'الخليل' , town : 'بني نعيم' },
    { city: 'الخليل' , town : 'بيت امير' },
    { city: 'الخليل' , town : 'بيت اولا' },
    { city: 'الخليل' , town : 'بيت عوا' },
    { city: 'الخليل' , town : 'بيت كاحل' },
    { city: 'الخليل' , town : 'حلحول' },
    { city: 'الخليل' , town : 'خاراس' },
    { city: 'الخليل' , town : 'دورا' },
    { city: 'الخليل' , town : 'سعير' },
    { city: 'الخليل' , town : 'صوريف' },
    { city: 'الخليل' , town : 'ترقوميا' },
    { city: 'الخليل' , town : 'تفوح' },
    { city: 'الخليل' , town : 'نوبا' },
    { city: 'الخليل' , town : 'يطا' },
    
    { city: 'القدس' , town : 'مدينة القدس' },
    { city: 'القدس' , town : 'ابو ديس' },
    { city: 'القدس' , town : 'الرام' },
    { city: 'القدس' , town : 'الزعيم' },
    { city: 'القدس' , town : 'السواحرة الشرقية' },
    { city: 'القدس' , town : 'الشيخ جراح' },
    { city: 'القدس' , town : 'الشيخ سعد' },
    { city: 'القدس' , town : 'الطور' },
    { city: 'القدس' , town : 'العيزرية' },
    { city: 'القدس' , town : 'العيساوية' },
    { city: 'القدس' , town : 'بدو' },
    { city: 'القدس' , town : 'بيت حنينا' },
    { city: 'القدس' , town : 'بيت صفافا' },
    { city: 'القدس' , town : 'حزما' },
    { city: 'القدس' , town : 'شعفاط' },
    { city: 'القدس' , town : 'عطروت' },
    { city: 'القدس' , town : 'عناتا' },
    { city: 'القدس' , town : 'قلنديا' },
    
    { city: 'بيت لحم' , town : 'مدينة بيت لحم' },
    { city: 'بيت لحم' , town : 'ارطاس' },
    { city: 'بيت لحم' , town : 'الخضر' },
    { city: 'بيت لحم' , town : 'الخليفات' },
    { city: 'بيت لحم' , town : 'الدوحة' },
    { city: 'بيت لحم' , town : 'الشواورة' },
    { city: 'بيت لحم' , town : 'التعامرة' },
    { city: 'بيت لحم' , town : 'العببيدية' },
    { city: 'بيت لحم' , town : 'الولجة' },
    { city: 'بيت لحم' , town : 'بتير' },
    { city: 'بيت لحم' , town : 'بيت جالا' },
    { city: 'بيت لحم' , town : 'بيت احور' },
    { city: 'بيت لحم' , town : 'بيت تعمر' },
    { city: 'بيت لحم' , town : 'بيت فجار' },
    { city: 'بيت لحم' , town : 'جناتا' },
    { city: 'بيت لحم' , town : 'حوسان' },
    { city: 'بيت لحم' , town : 'خلايل اللوز' },
    { city: 'بيت لحم' , town : 'دار صلاح' },
    { city: 'بيت لحم' , town : 'زعترة' },
    { city: 'بيت لحم' , town : 'تقوع' },
    { city: 'بيت لحم' , town : 'ظهرة الندى' },
    { city: 'بيت لحم' , town : 'نحالين' },
    
    
    { city: 'جنين' , town : 'مدينة جنين' },
    { city: 'جنين' , town : 'الجامعة العربية الامريكية' },
    { city: 'جنين' , town : 'الجديدة' },
    { city: 'جنين' , town : 'الرامة' },
    { city: 'جنين' , town : 'الجلمة' },
    { city: 'جنين' , town : 'الزبابدة' },
    { city: 'جنين' , town : 'السويطات' },
    { city: 'جنين' , town : 'المنشية' },
    { city: 'جنين' , town : 'اليامون' },
    { city: 'جنين' , town : 'برطعة' },
    { city: 'جنين' , town : 'برقين' },
    { city: 'جنين' , town : 'بير الباشا' },
    { city: 'جنين' , town : 'بيت قاد' },
    { city: 'جنين' , town : 'خروبة' },
    { city: 'جنين' , town : 'جبع' },
    { city: 'جنين' , town : 'دير ابو ضعيف' },
    { city: 'جنين' , town : 'دير غزالة' },
    { city: 'جنين' , town : 'رمانة' },
    { city: 'جنين' , town : 'سالم' },
    { city: 'جنين' , town : 'سهل مرج بن عامر' },
    { city: 'جنين' , town : 'سيليس' },
    { city: 'جنين' , town : 'سيلة الحاثية' },
    { city: 'جنين' , town : 'صانور' },
    { city: 'جنين' , town : 'عجة' },
    { city: 'جنين' , town : 'عرابة' },
    { city: 'جنين' , town : 'عنزة' },
    { city: 'جنين' , town : 'فحمة' },
    { city: 'جنين' , town : 'فقوعة' },
    { city: 'جنين' , town : 'قباطية' },
    { city: 'جنين' , town : 'كفر دان' },
    { city: 'جنين' , town : 'كفر راعي' },
    { city: 'جنين' , town : 'يعبد' },
    { city: 'جنين' , town : 'ميثلون' },

    {city:'رام الله والبيرة' , town:'رامالله'},
    {city:'رام الله والبيرة' , town:'البيرة'},
    {city:'رام الله والبيرة' , town:'ابو فش '},
    {city:'رام الله والبيرة' , town:'الطيرة'},
    {city:'رام الله والبيرة' , town:'المزرعة الشرقية'},
    {city:'رام الله والبيرة' , town:'المزرعة الغربية'},
    {city:'رام الله والبيرة' , town:'المغير'},
    {city:'رام الله والبيرة' , town:'المزرعة القبلية'},
    {city:'رام الله والبيرة' , town:'النبي صالح'},
    {city:'رام الله والبيرة' , town:'برقة'},
    {city:'رام الله والبيرة' , town:'بير زيت'},
    {city:'رام الله والبيرة' , town:'بير نبالا'},
    {city:'رام الله والبيرة' , town:'بلعين'},
    {city:'رام الله والبيرة' , town:'المزرعة القبلية'},
    {city:'رام الله والبيرة' , town:'بيت ريما'},
    {city:'رام الله والبيرة' , town:'بيت عور التحتا'},
    {city:'رام الله والبيرة' , town:'بيت لقيا'},
    {city:'رام الله والبيرة' , town:'بيت عور الفوقا'},
    {city:'رام الله والبيرة' , town:'بيت عور التحتا '},
    {city:'رام الله والبيرة' , town:'بيتونيا'},
    {city:'رام الله والبيرة' , town:'جبع'},
    {city:'رام الله والبيرة' , town:'جفنا'},
    {city:'رام الله والبيرة' , town:'بلعين'},
    {city:'رام الله والبيرة' , town:'خربة ابو فلاح'},
    {city:'رام الله والبيرة' , town:'خربثا المصباح'},
    {city:'رام الله والبيرة' , town:'دير السودان'},
    {city:'رام الله والبيرة' , town:'دير بزيع'},
    {city:'رام الله والبيرة' , town:'خربثا بني حارث'},
    {city:'رام الله والبيرة' , town:'دير جرير'},
    {city:'رام الله والبيرة' , town:'دير دبوان'},
    {city:'رام الله والبيرة' , town:'دير غسانة'},
    {city:'رام الله والبيرة' , town:'دير نظام'},
    {city:'رام الله والبيرة' , town:'رمون'},
    {city:'رام الله والبيرة' , town:'رافات'},
    {city:'رام الله والبيرة' , town:'روابي'},
    {city:'رام الله والبيرة' , town:'سردا'},
    {city:'رام الله والبيرة' , town:'سلود'},
    {city:'رام الله والبيرة' , town:'سنجل'},
    {city:'رام الله والبيرة' , town:'شقنا'},
    {city:'رام الله والبيرة' , town:'ترمسعيا'},
    {city:'رام الله والبيرة' , town:'عابود'},
    {city:'رام الله والبيرة' , town:'عبوين'},
    {city:'رام الله والبيرة' , town:'عطارة'},
    {city:'رام الله والبيرة' , town:'عين عريك'},
    {city:'رام الله والبيرة' , town:'عين سينا'},
    {city:'رام الله والبيرة' , town:'عين قينيا'},
    {city:'رام الله والبيرة' , town:'عين يبرود'},
    {city:'رام الله والبيرة' , town:'قبلان'},
    {city:'رام الله والبيرة' , town:'قدورة'},
    {city:'رام الله والبيرة' , town:'قراوة بني زيد'},
    {city:'رام الله والبيرة' , town:'كفر عقب'},
    {city:'رام الله والبيرة' , town:' كفر عين'},
    {city:'رام الله والبيرة' , town:'كفر مالك'},
    {city:'رام الله والبيرة' , town:'كوبر'},
    {city:'رام الله والبيرة' , town:'كفر نعمة'},
    {city:'رام الله والبيرة' , town:'مخيم الامعري'},
    {city:'رام الله والبيرة' , town:'مخيم الجلزون'},
    {city:'رام الله والبيرة' , town:'تعلين'},
    {city:'رام الله والبيرة' , town:'مزارع النوباني'},


    {city:'سلفيت' , town:'المدينة'},
    {city:'سلفيت' , town:'الزاوية'},
    {city:'سلفيت' , town:'سكاكا'},
    {city:'سلفيت' , town:'بديا'},
    {city:'سلفيت' , town:'الزاوية'},
    {city:'سلفيت' , town:'بروقين'},
    {city:'سلفيت' , town:'حارس'},
    {city:'سلفيت' , town:'خربة قيس'},
    {city:'سلفيت' , town:'دير استيا'},
    {city:'سلفيت' , town:'دير بلوط'},
    {city:'سلفيت' , town:'رافات'},
    {city:'سلفيت' , town:'فرخة'},
    {city:'سلفيت' , town:'سرطة'},
    {city:'سلفيت' , town:'قراوة بني حسان'},
    {city:'سلفيت' , town:'كفر الديك'},
    {city:'سلفيت' , town:'كفر حارس'},
    {city:'سلفيت' , town:'قيرة'},
    {city:'سلفيت' , town:'مردة'},
    {city:'سلفيت' , town:'مسحة'},
    {city:'سلفيت' , town:'ياسوف'},



    {city:'طوباس' , town:'المدينة'},
    {city:'طوباس' , town:'طمون'},
    {city:'طوباس' , town:'بردلة'},
    {city:'طوباس' , town:'عقابة'},
    {city:'طوباس' , town:'كردلا'},
    {city:'طوباس' , town:'مخيم الفارعة'},
    {city:'طوباس' , town:'واد الفارعة'},


    {city:'طولكرم' , town:'المدينة'},
    {city:'طولكرم' , town:'ارتاح'},
    {city:'طولكرم' , town:'الجاروشية'},
    {city:'طولكرم' , town:'اكتابا'},
    {city:'طولكرم' , town:'باقة الشرقية'},
    {city:'طولكرم' , town:'باقة الغربية'},
    {city:'طولكرم' , town:'الراس'},
    {city:'طولكرم' , town:'بلعا'},
    {city:'طولكرم' , town:'بيت ليد'},
    {city:'طولكرم' , town:'دير الغصون'},
    {city:'طولكرم' , town:'خربة العكابا'},
    {city:'طولكرم' , town:'ذنابة'},
    {city:'طولكرم' , town:'رامين'},
    {city:'طولكرم' , town:'زيتا'},
    {city:'طولكرم' , town:'سفارين'},
    {city:'طولكرم' , town:'شوفة'},
    {city:'طولكرم' , town:'صيدا'},
    {city:'طولكرم' , town:'عتيل'},
    {city:'طولكرم' , town:'عكابا'},
    {city:'طولكرم' , town:'علار'},
    {city:'طولكرم' , town:'عنبتا'},
    {city:'طولكرم' , town:'قفين'},
    {city:'طولكرم' , town:'فرعون'},
    {city:'طولكرم' , town:'كفر اللبد'},
    {city:'طولكرم' , town:'كفر رمان'},
    {city:'طولكرم' , town:'كفر صور '},
    {city:'طولكرم' , town:'مخيم نور شمس'},
    {city:'طولكرم' , town:'نزلة عيسى'},
    {city:'طولكرم' , town:'مخيم طولكرم'},



    {city:'غزة' , town:'المدينة'},
    {city:'غزة' , town:'بيت حانون'},
    {city:'غزة' , town:'بيت لاهيا'},
    {city:'غزة' , town:'جباليا'},
    {city:'غزة' , town:'خان يونس'},
    {city:'غزة' , town:'دير بلح'},
    {city:'غزة' , town:'رفح '},

    {city:'قلقيلية' , town:'المدينة'},
    {city:'قلقيلية' , town:'الرمضان الجنوبي'},
    {city:'قلقيلية' , town:'رمضان الشمالي'},
    {city:'قلقيلية' , town:'الفندق'},
    {city:'قلقيلية' , town:'النبي الياس'},
    {city:'قلقيلية' , town:'جيت'},
    {city:'قلقيلية' , town:'باقة الحطب'},
    {city:'قلقيلية' , town:'جيوس'},
    {city:'قلقيلية' , town:'حبلة'},
    {city:'قلقيلية' , town:'راس طيرة'},
    {city:'قلقيلية' , town:'راس عطية'},
    {city:'قلقيلية' , town:'جين صافوط'},
    {city:'قلقيلية' , town:'سنيرا'},
    {city:'قلقيلية' , town:'صير'},
    {city:'قلقيلية' , town:'عزون'},
    {city:'قلقيلية' , town:'عسلة'},
    {city:'قلقيلية' , town:'عزون عتمة'},
    {city:'قلقيلية' , town:'عسلة'},
    {city:'قلقيلية' , town:'عزون عتمة'},
    {city:'قلقيلية' , town:'فرعتا'},
    {city:'قلقيلية' , town:'فلامية'},
    {city:'قلقيلية' , town:'كفر ثلث'},
    {city:'قلقيلية' , town:'كفر سابا'},
    {city:'قلقيلية' , town:'كفر لاقف'},

    {city:'نابلس' , town:'المدية'},
    {city:'نابلس' , town:'الاغوار'},
    {city:'نابلس' , town:'الباذان'},
    {city:'نابلس' , town:'الساوية'},
    {city:'نابلس' , town:'العقربانية'},
    {city:'نابلس' , town:'بديا'},
    {city:'نابلس' , town:'النصارية'},
    {city:'نابلس' , town:'برقة'},
    {city:'نابلس' , town:'بلاطة'},
    {city:'نابلس' , town:'بورين'},
    {city:'نابلس' , town:'بيت امرين'},
    {city:'نابلس' , town:'بيت ابيا'},
    {city:'نابلس' , town:'بيت  دجن'},
    {city:'نابلس' , town:'بيت فوريك'},
    {city:'نابلس' , town:'بيت وزن'},
    {city:'نابلس' , town:'بيتا'},
    {city:'نابلس' , town:'جماعين'},
    {city:'نابلس' , town:'جوريش'},
    {city:'نابلس' , town:'جت'},
    {city:'نابلس' , town:'حوارة'},
    {city:'نابلس' , town:'دير شرف'},
    {city:'نابلس' , town:'زواتا'},
    {city:'نابلس' , town:'روجيت'},
    {city:'نابلس' , town:'صرة'},
    {city:'نابلس' , town:'سبسطية'},
    {city:'نابلس' , town:'طلوزة'},
    {city:'نابلس' , town:'تلفيت'},
    {city:'نابلس' , town:'عزموط'},
    {city:'نابلس' , town:'عسكر'},
    {city:'نابلس' , town:'تلفيت'},
    {city:'نابلس' , town:'عصيرة المالية'},
    {city:'نابلس' , town:'عقربا'},
    {city:'نابلس' , town:'عورتا'},
    {city:'نابلس' , town:'قوصين'},
    {city:'نابلس' , town:'كفر قليل'},
    {city:'نابلس' , town:'مادما'},
    {city:'نابلس' , town:'ياصيد'}
    

    
    
    
]



$("#town").prop('disabled', true);
$("#townWork").prop('disabled', true);

$("#city").change(function(){
	var city = $(this).val();
	var options =  '<option value=""><strong>القرية</strong></option>';
    var count = 0;  // for disabling the select or not    
   
	
	$(alltowns).each(function(index, value){
       
		if(value.city == city){
            
			options += '<option value="'+value.city+'">'+value.town+'</option>';
            count+=1;
		}
            
	});

    if(count > 1){
         $("#town").prop('disabled', false);
    }else {$("#town").prop('disabled', true); }
    
	$('#town').html(options);
    
   
    
});


$("#cityWork").change(function(){
	var city = $(this).val();
	var options =  '<option value=""><strong>القرية</strong></option>';
    var count = 0;
    
	$(alltowns).each(function(index, value){
       
		if(value.city == city){
			options += '<option value="'+value.city+'">'+value.town+'</option>';
            count+=1;
		}
	});
    
     if(count > 1){
         $("#townWork").prop('disabled', false);
    }else {$("#townWork").prop('disabled', true); }
    
    
	
	$('#townWork').html(options);
});